app/controllers/flowers_controller.rb

SELECT "flowers".* FROM "flowers"
---
  def index
    @flowers = Flower.all

SELECT "infos".* FROM "infos" WHERE "infos"."flower_id" = ?  [["flower_id", 21]]
---
  def show
    @infos = Info.where(flower_id: @flower.id)

INSERT INTO "flowers" ("name", "kana", "words", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["kana", ""], ["words", ""], ["created_at", "2022-03-30 05:09:31.888577"], ["updated_at", "2022-03-30 05:09:31.888577"]]
INSERT INTO "infos" ("flower_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["flower_id", 20], ["date", "2020-03-07"], ["created_at", "2022-03-31 06:57:59.685278"], ["updated_at", "2022-03-31 06:57:59.685278"]]
---
  def create
    @flower = Flower.new(flower_params)

    respond_to do |format|
      if @flower.save
        dates = []
        if params["flower"]["date1(2i)"] != "" && params["flower"]["date1(3i)"] != ""
          dates << Date.new(2020,params["flower"]["date1(2i)"].to_i, params["flower"]["date1(3i)"].to_i)
        end
        if params["flower"]["date2(2i)"] != "" && params["flower"]["date2(3i)"] != ""
          dates << Date.new(2020,params["flower"]["date2(2i)"].to_i, params["flower"]["date2(3i)"].to_i)
        end
        if params["flower"]["date3(2i)"] != "" && params["flower"]["date3(3i)"] != ""
          dates << Date.new(2020,params["flower"]["date3(2i)"].to_i, params["flower"]["date3(3i)"].to_i)
        end
        dates.each do |hiduke|
          info = Info.new(flower_id: @flower.id,date: hiduke)
          info.save

SELECT  "flowers".* FROM "flowers" WHERE "flowers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_flower
      @flower = Flower.find(params[:id])